[{"time":1766726825,"type":"story","descendants":335,"title":"Rob Pike Goes Nuclear over GenAI","id":46389444,"score":373,"url":"https://imgur.com/nUJCI3o","by":"signa11","summary":"## Rob Pike 对生成式 AI 的强烈批评总结\n\n本文（通过图片和标题）主要表达了 Rob Pike 对生成式 AI (GenAI) 的强烈不满和批评。\n\n**核心观点:**\n\nRob Pike，Go 语言的创造者之一，对当前生成式 AI 的发展方向表达了高度的否定态度，甚至使用了“Nuclear”（核弹级的）一词来形容他的不满。\n\n**具体内容:**\n\n*   **平台:** 批评主要通过 Imgur 平台上的图片和标题呈现，表明其影响力可能超出技术圈。\n*   **事件:** 具体引发 Rob Pike 如此强烈反应的原因并未在提供的信息中明确说明，但可以推断是与生成式 AI 相关的某个事件或趋势。\n*   **情绪:**  “Nuclear”一词暗示了 Rob Pike 认为生成式 AI 的发展对软件工程领域造成了严重的、甚至是灾难性的影响。\n*   **暗示:** 隐含的观点是，当前生成式 AI 的发展方向可能与软件工程的原则和价值观相悖，例如代码质量、可维护性、可理解性等。\n\n**总结:**\n\n总而言之，该内容表明了 Rob Pike 对生成式 AI 发展方向的强烈反对，并用“Nuclear”一词强调了其负面影响的严重程度。 具体原因未详细说明，但暗示了对生成式 AI 对软件工程领域可能造成的潜在危害的担忧。\n"},{"time":1766679885,"type":"story","descendants":112,"title":"I sell onions on the Internet (2019)","id":46385308,"score":372,"url":"https://www.deepsouthventures.com/i-sell-onions-on-the-internet/","by":"sogen","summary":"## 维达利亚洋葱的互联网之旅：一个意外的创业故事 (Wéidáliyà yángcóng de hùliánwǎng zhī lǚ: yī gè yìwài de chuàngyè gùshì)\n\nThis article details the unexpected journey of Peter Askew, a web developer, into the business of selling Vidalia onions online. It chronicles how the domain name [VidaliaOnions.com](https://www.vidaliaonions.com/) sparked an unusual entrepreneurial venture.\n\n**起源：域名与灵感 (Qǐyuán: Yúmíng yǔ línggǎn)**\n\nIn 2014, the domain name [VidaliaOnions.com](https://www.vidaliaonions.com/) was put up for auction after expiring. Askew, a Georgia native with a hobby of acquiring and developing expired domain names, bid on it for $2,200, initially as a spectator. He unexpectedly won the auction. The name, however, began to \"speak\" to him, guiding him toward a business idea. He was inspired by Harry & David’s farm-to-door pear service, envisioning a similar model for Vidalia onions.\n\n**起步与合作 (Qǐbù yǔ hézuò)**\n\nDespite lacking experience in agriculture or logistics, Askew decided to \"just start.\" He contacted the Vidalia Onion Committee, who introduced him to several farmers. He formed a partnership with Aries Haygood, a third-generation farmer with an award-winning Vidalia onion farm.  Haygood’s farm provided the onions, packing facilities, and agricultural expertise, while Askew focused on customer service, marketing, branding, web development, and logistics.\n\n**发展与成功 (Fāzhǎn yǔ chénggōng)**\n\nInitially, they projected 50 orders for the 2015 season but received over 600. The business rapidly grew, with other mail-order operations directing customers their way. They expanded marketing efforts with billboards, sponsorships, and a phone order hotline.  Askew experienced setbacks, such as a costly mistake with faulty shipping boxes, but persevered. \n\n**客户忠诚与价值 (Kèhù zhōngchéng yǔ jiàzhí)**\n\nThe business’s success is evidenced by strong customer loyalty, as demonstrated by a customer enthusiastically calling out “The Vidalia Man!” upon receiving a phone call. Askew emphasizes a focus on purpose over profit, finding the work rewarding and impactful.  After five seasons, Peter Askew continues to sell Vidalia onions online, documenting his journey on Twitter.\n\n**核心要点 (Héxīn yàodiǎn):**\n\n*   The business began with the acquisition of an expired domain name.\n*   The domain name inspired the business idea and guided its development.\n*   A partnership with a local farmer was crucial to the operation.\n*   Customer service and branding played a significant role in the business’s success.\n*   The business prioritizes purpose and customer impact over purely profit-driven goals."},{"time":1766708980,"type":"story","descendants":98,"title":"Seven Diabetes Patients Die Due to Undisclosed Bug in Abbott's Glucose Monitors","id":46388040,"score":321,"url":"https://sfconservancy.org/blog/2025/dec/23/seven-abbott-freestyle-libre-cgm-patients-dead/","by":"pabs3","summary":"## 连续血糖监测设备缺陷导致七人死亡：对开源软件的呼吁 (Liánxù Xuètáng Jiāncè Shèbèi Quēxiàn Dǎozhì Qī Rén Sǐwáng: Duì Kāiyuán Ruǎnjiàn de Hūyù)\n\n这篇文章讲述了作者因糖尿病诊断而使用阿伯特公司的连续血糖监测（CGM）设备Freestyle Libre Plus的经历，以及由此引发的对医疗器械行业，特别是专有软件安全性的担忧。\n\n**主要内容：**\n\n*   **设备缺陷与死亡事件：** 作者收到药房发来的警报短信，得知阿伯特公司发布的关于Freestyle Libre Plus CGM设备缺陷的FDA公告。该缺陷导致设备错误地报告血糖过低，造成超过700人受伤，并导致7人死亡。由于作者糖尿病处于早期阶段，因此相对安全。\n*   **历史教训：** 文章提到了过去医疗器械软件缺陷造成的悲剧，如1985年的Therac-25事件和2020年眼科植入物问题，强调了专有软件在医疗领域可能造成的危害。\n*   **开源软件的潜在优势：** 作者认为，如果阿伯特公司公开硬件规格和源代码（CCS），可能可以避免这些悲剧。开源软件（FOSS）通过广泛的同行评审，可以提高设备的安全性、可靠性和透明度。作者强调，开源不仅能发现bug，还能促进对硬件和软件设计的全面审查。\n*   **监管与问责：** 文章指出，政府监管机构对该问题调查的程度尚不清楚，并呼吁公开设备的技术细节，允许非政府组织参与安全评估。作者认为，目前追究公司责任的主要途径是 wrongful death 诉讼，但许多用户已经同意了阿伯特公司应用程序中的单向免责条款，这可能会增加起诉的难度。\n*   **未来行动：** 作者呼吁尽快对阿伯特公司提起集体诉讼，并寻求志愿者对旧CGM设备进行拆解和逆向工程，以提取软件组件或分析硬件设计。同时，作者计划为Juggluco（一个开源CGM应用程序）贡献补丁，并将其发布到F-Droid应用商店。作者认为，在医疗器械公司损害患者权益的情况下，投入时间和精力到开源社区是最佳的应对方式。\n*   **阿伯特的网站数据不一致：** 作者发现，FDA的召回列表上显示其一个CGM的批号属于召回批次，但阿伯特公司的网站却显示该批号是“安全使用”的，质疑了阿伯特公司网站数据的可靠性。\n\n**总结：**\n\n这篇文章呼吁医疗器械行业更加重视患者的安全和权益，并强调开源软件在提高医疗设备安全性和透明度方面的潜力。作者通过个人经历和历史案例，揭示了专有软件在医疗领域可能造成的危害，并呼吁采取行动来保护患者的健康和安全。"},{"time":1766704401,"type":"story","descendants":65,"title":"Maybe the default settings are too high","id":46387657,"score":210,"url":"https://www.raptitude.com/2025/12/maybe-the-default-settings-are-too-high/","by":"htk","summary":"## 文章总结：默认设置可能过高 (默认速度可能过快)\n\n这篇文章探讨了在阅读、饮食等活动中，放慢速度带来的益处。作者以阅读《魔戒》为例，分享了自己通过大幅降低阅读速度（大约是平时速度的三倍）所获得的阅读体验提升。\n\n**主要观点：**\n\n*   **放慢速度，提升体验：** 作者发现，放慢阅读速度，给予每个句子更多的时间和关注，能让故事的细节、氛围和意境更好地在脑海中展开，从而获得更深刻的阅读体验。这类似于吃东西时放慢速度，更能品尝到食物的美味。\n*   **“好东西”的释放：** 这种提升并非需要主动寻找，而是放慢速度后，内在的“好东西”（例如阅读中的意义、品尝食物中的快乐）会自然而然地浮现出来。\n*   **默认速度的局限性：** 现代社会快节奏的生活，推动我们加快了对各种事物的消费速度，这可能掩盖了事物本身的价值。像真空吸尘器一样，快速的动作可能会错过一些细节。\n*   **改变消费选择：** 放慢消费速度也会影响我们选择消费的内容。例如，细嚼慢咽会让你发现廉价零食的平庸，而细细品味自制糕点则能发现更多惊喜。\n*   **对文化的反思：** 快速消费的习惯也影响了文化的发展，导致更多产品和服务专注于提供表面上的满足，而忽略了更深层次的价值。作者指出，我们可能已经远离了最佳的消费模式。\n\n**总结：**\n\n作者鼓励读者尝试放慢消费速度，即使看起来很慢，也能获得更多回报。这不仅适用于阅读和饮食，也适用于其他方面，例如处理邮件、撰写购物清单等。放慢速度，也许能让我们重新发现事物的美好，并找到更充实的生活方式。文章最后提到了一个关于戒除不良习惯的讨论区，鼓励读者尝试在新年期间戒除一些习惯。\n\n**关键词：** 放慢速度，阅读，饮食，体验，默认设置，文化，消费。\n\n\n\n## 文章总结 (中文):\n\n这篇文章探讨了放慢生活节奏的重要性，尤其是在阅读和饮食等活动中。作者通过自己阅读《魔戒》的经历，发现大幅降低阅读速度可以显著提升阅读体验，让故事的细节和意境更加深刻。\n\n**核心观点：**\n\n*   **慢下来，体验更多：** 放慢阅读和饮食的速度，给予更多的时间和关注，可以获得更丰富的体验，类似于品尝美食一样。\n*   **内在价值的显现：** 这种体验的提升并非需要主动寻找，而是放慢速度后，内在的价值和乐趣自然而然地浮现出来。\n*   **快节奏的弊端：** 现代社会快节奏的生活方式，可能让我们忽略了事物本身的价值，就像快速吸尘器可能错过一些灰尘一样。\n*   **消费选择的转变：** 放慢速度也会影响我们的消费选择，细品自制糕点更能发现其美味，而快速食用廉价零食则会发现其平庸。\n*   **对文化的反思：** 快速消费也影响了文化的发展，导致更多产品和服务专注于提供表面的满足，而忽略了更深层次的价值。\n\n**总结：**\n\n作者鼓励大家尝试放慢消费速度，即使看起来很慢，也能获得更多回报。这不仅适用于阅读和饮食，也适用于生活中的其他方面。放慢节奏，也许能让我们重新发现生活的美好，并找到更充实的生活方式。文章最后提到了一个戒除不良习惯的讨论区，鼓励大家在新年尝试改变。\n\n**关键词：** 放慢节奏，阅读，饮食，体验，默认速度，文化，消费。\n"},{"time":1766710973,"type":"story","descendants":59,"title":"MiniMax M2.1: Built for Real-World Complex Tasks, Multi-Language Programming","id":46388213,"score":165,"url":"https://www.minimaxi.com/news/minimax-m21","by":"110","summary":"## MiniMax M2.1 模型发布总结\n\n**日期：** 2025年12月23日\n\nMiniMax 发布了 M2.1 模型，旨在提升企业和个人在 AI 原生工作和生活方式方面的应用能力。M2.1 是在 M2 基础上进一步改进，重点提升了真实世界复杂任务的表现，尤其是在编程语言和办公场景方面。\n\n**主要亮点：**\n\n*   **卓越的多编程语言能力：** 系统性提升了 Rust、Java、Golang、C++、Kotlin、Objective-C、TypeScript 和 JavaScript 等语言的能力，覆盖从底层系统到应用层的开发。\n*   **WebDev 与 AppDev 能力跃迁：** 显著加强了原生 Android/iOS 开发能力，并提升了模型在 Web 和 App 场景中的设计理解和美学表达能力。\n*   **复合指令约束提升：** 升级了系统性问题解决能力，确保模型关注代码执行正确性和对复合指令的整合执行，提高办公场景的可用性。\n*   **简洁高效的回复：** 模型回复和思维链更简洁，响应速度提升，Token 消耗减少，提高 AI 编码和 Agent 驱动工作流的效率。\n*   **出色的 Agent / 工具脚手架泛化能力：** 在多种编程工具和 Agent 框架中表现稳定，支持多种 Context Management 机制。\n*   **高质量对话和写作：** 除了代码能力，M2.1 在日常对话、技术说明和写作场景中也能提供更详细和结构化的回答。\n\n**基准测试结果：**\n\n*   M2.1 在软件工程相关场景的核心榜单上表现显著提升，尤其是在多语言场景上，超过了 Claude Sonnet 4.5 和 Gemini 3 Pro，并接近 Claude Opus 4.5。\n*   在 SWE-bench Verified 测试中，M2.1 在不同 coding agent 框架上表现良好，并在多个细分场景中表现出全面提升。\n*   **VIBE 测试集：** MiniMax 开源了全新基准 VIBE (Visual & Interactive Benchmark for Execution)，用于衡量模型构建完整应用程序的全栈能力。M2.1 在 VIBE 综合榜单中表现卓越，平均得分为 88.6 分，接近 Claude Opus 4.5。\n*   在办公场景、长程工具调用和综合智能指数方面也有稳步提升。\n\n**用户评价：**\n\n来自 AI 平台和合作方的反馈显示，M2.1 在软件开发任务中表现出色，能够提供前沿水平的性能，并与生产级工程要求高度契合。\n\n**Showcases (应用展示):**\n\n*   **物理世界 Agent：** M2.1 驱动的机器狗。\n*   **3D 交互式动画：** 基于 React Three Fiber 构建的“3D 梦幻圣诞树”。\n*   **Web UI 前卫设计：** 极简主义摄影师个人主页。\n*   **原生 App 开发：** 安卓重力感应模拟器和 iOS 桌面交互小组件。\n*   **Web 音频模拟开发：** 16 步鼓机模拟器。\n*   **Rust 安全审计 TUI：** CLI + TUI 风格的 Linux 安全审计工具。\n*   **Python 数据监控看板：** 黑客帝国风格的实时数据监控面板。\n*   **C++ 图像渲染**\n*   **Java 实时弹幕**\n*   **SVG 生成**\n*   **Tool use (工具调用) 能力：** excel 市场调研\n*   **数字员工：** 在通讯软件上处理设备请求，在项目管理软件上解决问题，并在代码库中查找信息。\n\n**如何使用：**\n\n*   MiniMax 开放平台：<https://platform.minimaxi.com/docs/guides/text-generation>\n*   MiniMax Agent 产品：<https://agent.minimaxi.com/>\n*   开源和本地部署：<https://huggingface.co/MiniMaxAI/MiniMax-M2.1> 和 <https://github.com/MiniMax-AI/MiniMax-M2.1>\n\nMiniMax 提供了 M2.1 和 M2.1-lightning 两个 API 版本，后者速度更快。同时，M2.1 支持自动 Cache，为用户带来更流畅的体验和更低的成本。"},{"time":1766678937,"type":"story","descendants":219,"title":"Ask HN: What skills do you want to develop or improve in 2026?","id":46385197,"score":151,"by":"meridion","text":"Thread for 2025: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=42509408\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=42509408</a><p>Thread for 2024: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=38782613\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=38782613</a><p>Thread for 2023: <a href=\"https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=33873800\">https:&#x2F;&#x2F;news.ycombinator.com&#x2F;item?id=33873800</a><p>Here are mine:<p>Technical skills:<p>- Among my last year&#x27;s goals was to take on VR dev, which sadly I did not get to. Punting it to 2026. I&#x27;m thinking to get the Samsung Galaxy XR and experiment with some VR apps and learn the fundamentals of spatial computing. As an Android mobile developer, that feels like a natural extension.<p>- Complete the &quot;UCSanDiegoX: Computer Graphics II: Rendering&quot; computer graphics course. I did the first course in the series and found it enlightening (no pun intended)<p>- Create an e2e project that earns money as a side gig. It&#x27;s time to put my product and technical knowledge to practice and actually build something people want.<p>- Leverage AI across all my endeavors. AI tools are here to stay and the more I know how to use them effectively, the better. The speed boost in learning a new framework&#x2F;concept is phenomenal.<p>Non-technical skills:<p>- Expand my social circle - the unstable tech climate made me realize the importance of maintaining a healthy social network. My goal is to connect with more people both inside my company and outside, by both proactively reaching out and going to meetups in my area. In fact, I invite fellow NYC-based HN-ers to contact me at cybercreampuff at yahoo dot com, in case you want to meet up!","summary":"https://news.ycombinator.com/item?id=46385197"},{"time":1766688014,"type":"story","descendants":18,"title":"Fahrplan – 39C3","id":46386211,"score":144,"url":"https://fahrplan.events.ccc.de/congress/2025/fahrplan/","by":"rurban","summary":"https://fahrplan.events.ccc.de/congress/2025/fahrplan/"},{"time":1766719189,"type":"story","descendants":24,"title":"TurboDiffusion: 100–200× Acceleration for Video Diffusion Models","id":46388907,"score":119,"url":"https://github.com/thu-ml/TurboDiffusion","by":"meander_water","summary":"TurboDiffusion: 100–200× Acceleration for Video Diffusion Models - thu-ml/TurboDiffusion"},{"time":1766693676,"type":"story","descendants":52,"title":"UBlockOrigin and UBlacklist AI Blocklist","id":46386761,"score":117,"url":"https://github.com/laylavish/uBlockOrigin-HUGE-AI-Blocklist","by":"_____k","summary":"A huge blocklist of manually curated sites that contain AI generated imagery for uBlock Origin &amp; uBlacklist. - laylavish/uBlockOrigin-HUGE-AI-Blocklist"},{"time":1766686004,"type":"story","descendants":72,"title":"Critical vulnerability in LangChain – CVE-2025-68664","id":46386009,"score":112,"url":"https://cyata.ai/blog/langgrinch-langchain-core-cve-2025-68664/","by":"shahartal","summary":"Cyata discloses LangGrinch (CVE-2025-68664), a critical LangChain Core serialization injection bug where untrusted, LLM-influenced metadata can be rehydrated as objects, enabling secret leaks and unsafe instantiation. Patch guidance included."},{"time":1766698608,"type":"story","descendants":98,"title":"Google is 'gradually rolling out' option to change your gmail.com address","id":46387192,"score":108,"url":"https://9to5google.com/2025/12/24/google-change-gmail-addresses/","by":"geox","summary":"Google says on a support page that it is &quot;gradually rolling out&quot; a new change allowing users to change their Gmail address."}]